In [1]:
import pandas as pd   # CARREGAR E TRATAR OS ARQUIVOS
import matplotlib.pyplot as plt  # GERAR VISUALIZAÇÕES GRÁFICAS
import seaborn as sns # GERAR VISUALIZAÇÕES GRÁFICAS
import os # GERENCIAR O SISTEMA OPERACIONAL

### CARREGAR OS ARQUIVOS DE VENDA

In [2]:
# CAMINHO DA PASTA COM OS DOCUMENTOS
caminhoPasta = './arquivos/vendas/'

# CRIAR UMA LISTA VAZIA PARA SALVAR OS CAMINHOS
diretorios = []

# LAÇO DE REPETIÇÃO É USADO PARA LOCALIZAR OS ARQUIVOS DO DIRETÓRIO

for file in os.listdir(caminhoPasta): # os.listdir serve para juntar todos os arquivos na pasta
    diretorios.append(caminhoPasta + file)

diretorios

# CRIAR UM DATAFRAME VAZIO

df_final = pd.DataFrame()

# ABRIR OS DOCUMENTOS E AGRUPAR EM UM ÚNICO DATAFRAME
for path in diretorios:
    df = pd.read_excel(path)
    df_final = pd.concat([df_final,df]) # ele pega o df_final que é vazio e passa o df que esta sendo feito as leituras e passa para o df_final e concatena todos os arquivos em apenas um só


# SALVAR O DATAFRAME COMO CSV NA SUA PASTA
df_final.to_csv('./arquivos/ArquivoCombinado.csv')

In [3]:
# CARREGANDO ARQUIVO BASE META NEW, E DIMENSÕES

dfmetas = pd.read_excel('./arquivos/base-meta-new.xlsx')
dfClientes = pd.read_excel('./arquivos/Dimensões.xlsx',sheet_name='Cliente')
dfProduto = pd.read_excel('./arquivos/Dimensões.xlsx',sheet_name = 'Produto')
dfVendedores = pd.read_excel('./arquivos/Dimensões.xlsx',sheet_name = 'Vendedor')
dfGrupoProduto = pd.read_excel('./arquivos/Dimensões.xlsx',sheet_name = 'GrupoProduto')
dfDatas = pd.read_excel('./arquivos/Dimensões.xlsx',sheet_name = 'Data')

# VISUALIZAR O CABEÇALHO DO DATAFRAME METAS
dfmetas = dfmetas.iloc[3:,1:].reindex() # no iloc [linha, coluna]

 # RESETAR O INDICE DO DATAFRAME
dfmetas.reset_index(0,# inicio do indice
                    drop=True, # REMOVE A COLUNA(INDICE) JÁ EXISTENTE
                    inplace=True # APLICA AS ALTERAÇÕES NO OBJETO
                    )

dfmetas.columns = ['cdVendedor','data','meta']

In [4]:
dfClientes.head(1)

   cdCliente                  Razão Social Status Categoria    Cidade  UF
0    1339104  Vinicius e Filipe Cantina ME      A  Cantinas  Curitiba  PR

In [5]:
dfClientes.columns = ['cdvendedor','razão social','status','categoria','cidade','uf']

dfProduto.columns = ['cdvendedor','descrição','cdgrupo']

dfVendedores.columns = ['cdvendedor','vendedor','cdsupervisor','supervisor','cdgerente','gerente','equipe']

dfGrupoProduto.columns = ['cdgrupo','grupo','linha']

dfDatas.columns = ['data','ano','mes','mesnum','dia']

In [6]:
# verificação dos tipos de dados

dfmetas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 792 entries, 0 to 791
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   cdVendedor  792 non-null    object
 1   data        792 non-null    object
 2   meta        792 non-null    object
dtypes: object(3)
memory usage: 18.7+ KB

In [7]:
dfClientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1411 entries, 0 to 1410
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cdvendedor    1411 non-null   int64
 1   razão social  1411 non-null   object
 2   status        1411 non-null   object
 3   categoria     1411 non-null   object
 4   cidade        1411 non-null   object
 5   uf            1411 non-null   object
dtypes: int64(1), object(5)
memory usage: 66.3+ KB

In [8]:
dfProduto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2736 entries, 0 to 2735
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   cdvendedor  2736 non-null   int64
 1   descrição   2736 non-null   object
 2   cdgrupo     2736 non-null   int64
dtypes: int64(2), object(1)
memory usage: 64.2+ KB

In [9]:
dfVendedores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cdvendedor    12 non-null     int64
 1   vendedor      12 non-null     object
 2   cdsupervisor  12 non-null     int64
 3   supervisor    12 non-null     object
 4   cdgerente     12 non-null     int64
 5   gerente       12 non-null     object
 6   equipe        12 non-null     object
dtypes: int64(3), object(4)
memory usage: 800.0+ bytes

In [10]:
dfGrupoProduto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   cdgrupo  36 non-null     int64
 1   grupo    36 non-null     object
 2   linha    36 non-null     object
dtypes: int64(1), object(2)
memory usage: 992.0+ bytes

In [11]:
dfDatas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1095 entries, 0 to 1094
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    1095 non-null   datetime64[ns]
 1   ano     1095 non-null   int64
 2   mes     1095 non-null   object
 3   mesnum  1095 non-null   int64
 4   dia     1095 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 42.9+ KB

In [12]:
dfmetas.isnull().sum()

cdVendedor    0
data          0
meta          0
dtype: int64

In [13]:
dfClientes.isnull().sum()

cdvendedor      0
razão social    0
status          0
categoria       0
cidade          0
uf              0
dtype: int64

In [14]:
dfProduto.isnull().sum()

cdvendedor    0
descrição     0
cdgrupo       0
dtype: int64

In [15]:
dfVendedores.isnull().sum()

cdvendedor      0
vendedor        0
cdsupervisor    0
supervisor      0
cdgerente       0
gerente         0
equipe          0
dtype: int64

In [16]:
dfGrupoProduto.isnull().sum()

cdgrupo    0
grupo      0
linha      0
dtype: int64

In [17]:
dfDatas.isnull().sum()

data      0
ano       0
mes       0
mesnum    0
dia       0
dtype: int64

In [18]:
dfDatas.describe()

                      data         ano       mesnum          dia
count                 1095  1095.00000  1095.000000  1095.000000
mean   2018-07-02 00:00:00  2018.00000     6.526027    15.720548
min    2017-01-01 00:00:00  2017.00000     1.000000     1.000000
25%    2017-10-01 12:00:00  2017.00000     4.000000     8.000000
50%    2018-07-02 00:00:00  2018.00000     7.000000    16.000000
75%    2019-04-01 12:00:00  2019.00000    10.000000    23.000000
max    2019-12-31 00:00:00  2019.00000    12.000000    31.000000
std                    NaN     0.81687     3.449427     8.800266

### ANÁLISES EXPLORATÓRIAS

Valor total vendido e Valor total da meta por ano?

In [ ]:
# ADICIONAR A COLUNA VALOR TOTAL AO DATAFRMAE
df_final['valorTotal'] = df_final['QtdItens'] * df_final['ValorUnitario']

df_final.head()

dfDatas

In [28]:
df_final[['QtdItens','valorTotal']].sum()

df_result = pd.merge(df_final,
         dfDatas,
         left_on='DataEmissao', # A TABELA DA ESQUERDA É O DF_FINAL/PRINCIPAL
         right_on='data'  # A TABELA DA DIREITA É A QUAL QUEREMOS TRAZER AS INFORMAÇÕES PARA A DF_FINAL QUE SERÁ A TABELA DFDATAS
         )

,DataEmissao,DataVencimento,NFe,cdCliente,cdVendedor,cdProduto,QtdItens,ValorUnitario,Peso Líquido,valorTotal,data,ano,mes,mesnum,dia
0,2017-01-12,2017-02-22,1492762,3140218,265,1073,6,8.83,0.60,52.98,2017-01-12,2017,Janeiro,1,12
1,2017-01-12,2017-02-22,1492762,3140218,265,1420,6,4.44,5.40,26.64,2017-01-12,2017,Janeiro,1,12
2,2017-01-12,2017-02-22,1492762,3140218,265,264,10,0.96,1.92,9.60,2017-01-12,2017,Janeiro,1,12
3,2017-01-13,2017-01-29,1492719,2983332,265,1154,6,2.92,1.26,17.52,2017-01-13,2017,Janeiro,1,13
4,2017-01-13,2017-01-29,1492719,2983332,265,1527,6,2.81,1.40,16.86,2017-01-13,2017,Janeiro,1,13
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
260091,2019-03-12,2019-04-14,2173547,673190,265,202,24,1.62,1.50,38.88,2019-03-12,2019,Março,3,12
260092,2019-03-12,2019-04-14,2173547,673190,265,1154,12,3.25,1.75,39.00,2019-03-12,2019,Março,3,12
260093,2019-03-12,2019-04-14,2173547,673190,265,668,12,3.26,1.00,39.12,2019-03-12,2019,Março,3,12
260094,2019-03-12,2019-04-14,2173547,673190,265,1527,12,3.14,1.00,37.68,2019-03-12,2019,Março,3,12
260095,2019-03-13,2019-04-05,2172961,3771379,215,257,6,4.42,1.20,26.52,2019-03-13,2019,Março,3,13